# Clean and Manipulate Data

In [1]:
import pandas as pd

# Load the Dataset
We will start by importing the necessary libraries and loading the dataset into a pandas DataFrame. We will use the read_csv function to read the data from a CSV file into a DataFrame.

In [2]:
# Load the dataset into a DataFrame
df = pd.read_csv("https://raw.githubusercontent.com/cbtn-data-science-ml/python-for-data-analysis/main/datasets/mls_salaries.csv")

In [3]:
df.head()

  club last_name first_name position  base_salary  guaranteed_compensation
0  ATL   Almiron     Miguel        M    1912500.0               2297000.00
1  ATL   Ambrose      Mikey        D      65625.0                 65625.00
2  ATL      Asad      Yamil        M     150000.0                150000.00
3  ATL     Bloom       Mark        D      99225.0                106573.89
4  ATL  Carleton     Andrew        F      65000.0                 77400.00

# Clean Data
Clean the data to prepare it for further analysis by checking for missing values.

In [4]:
# Check for missing values
df.isnull().sum()

club                        1
last_name                   1
first_name                  5
position                   11
base_salary                 1
guaranteed_compensation     1
dtype: int64

# Manipualte Data
Clean the data to prepare it for further analysis by checking for missing values.

* Convert data types for columns as needed
* Remove unnecessary columns
* Add new columns or transform existing columns

In [5]:
# Drop missing values
df.dropna(inplace = True) # inplace = True makes this change permanent

In [6]:
# Check for missing values
df.isnull().sum()

club                       0
last_name                  0
first_name                 0
position                   0
base_salary                0
guaranteed_compensation    0
dtype: int64

In [11]:
def clean_currency(x):
    """ If the value is a string, then remove currency symbol and delimiters
    otherwise, the value is numeric and can be converted
    """
    if isinstance(x, str):
        return(x.replace('$', '').replace(',', '')) # replacing "$" and "," with a space
    return(x)

# Convert data types for columns
df['base_salary_2'] = df['base_salary'].apply(clean_currency).astype('int')

In [12]:
df["base_salary"]

0      1912500
1        65625
2       150000
3        99225
4        65000
        ...
609     352000
610     126500
611      80000
612     350000
614     175000
Name: base_salary, Length: 600, dtype: int32